Revit 2022 API
AnalyticalModelSketchComponent.Dispose Method
Releases all resources used by the AnalyticalModelSketchComponent
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace